EnergyMicro/EFM32_Gxxx_DK/examples/preamp/preamp.c
/***************************************************************************//**
 * @file
 * @brief Preamplifier example for EFM32_Gxxx_DK
 * @details
 *   Use ADC/DAC/TIMER/DMA/PRS in order to amplify input signal and loop it
 *   back to audio out. The main point with this example is to show the use
 *   of the above peripherals, only simple audio processing is used.
 *
 * @note
 *   WARNING: Do not attach or use headphones with this example. Use small
 *   loadspeakers with built in amplification, ensuring volume is at an
 *   acceptable level. Exposure to loud noises from any source for extended
 *   periods of time may temporarily or permanently affect your hearing. The
 *   louder the volume sound level, the less time is required before your
 *   hearing could be affected. Hearing damage from loud noise is sometimes
 *   undetectable at first and can have a cumulative effect.
 *
 * @par Usage
 *   Use potentiometer to control amplification. The volume level is
 *   indicated by the 14 rightmost user LEDs. Audio out clipping may be done
 *   due to too high input signal and/or to high volume setting. Clipping is
 *   indicated by the leftmost user LED. Reduce volume level or audio input
 *   level to avoid.
 *
 * @author Energy Micro AS
 * @version 3.20.0
 *******************************************************************************
 * @section License
 * <b>(C) Copyright 2012 Energy Micro AS, http://www.energymicro.com</b>
 *******************************************************************************
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 * 4. The source and compiled code may only be used on Energy Micro "EFM32"
 *    microcontrollers and "EFR4" radios.
 *
 * DISCLAIMER OF WARRANTY/LIMITATION OF REMEDIES: Energy Micro AS has no
 * obligation to support this Software. Energy Micro AS is providing the
 * Software "AS IS", with no express or implied warranties of any kind,
 * including, but not limited to, any implied warranties of merchantability
 * or fitness for any particular purpose or warranties against infringement
 * of any proprietary rights of a third party.
 *
 * Energy Micro AS will not be liable for any consequential, incidental, or
 * special damages, or any other relief, or for any claim by any third party,
 * arising from your use of this Software.
 *
 *****************************************************************************/
#include "bsp.h"
#include "bsp_trace.h"
#include "em_chip.h"
#include "em_emu.h"
#include "em_cmu.h"
#include "em_adc.h"
#include "em_dac.h"
#include "em_prs.h"
#include "em_timer.h"
#include "em_dma.h"
#include "dmactrl.h"
#include "rtcdrv.h"

/*
   Audio in/out handling:
   ----------------------

                     EFM32 DVK preamp implementation overview

                                 | Audio in
                                 V
   +------+     +-----+       +------+       +-----+         +--------+
   |TIMER0|---->| PRS |--+--->| ADC0 |------>| DMA |-------->| Buffer |
   +------+     +-----+  |    +------+       +-----+         +--------+
                         |                      |                 |
                         |                      V                 |
                         |                   +-----+              |
                         |                   | DMA |              |
                         |                   | IRQ |              V
                         |                   +-----+         +--------+
                         |                      |            | PendSV |Process
                         |                      +----------->|   IRQ  |data
                         |                      Trigger      +--------+
                         |                      PendSV            |
                         |                                        V
                         |    +------+       +-----+         +--------+
                         +--->| DAC0 |<------| DMA |<--------| Buffer |
                              +------+       +-----+         +--------+
                                 |
                                 V Audio out

   1. TIMER0 is set to overflow appr. PREAMP_AUDIO_SAMPLE_RATE times per seconds,
      triggering a pulse to the PRS module on each overflow.

   2. ADC0 is configured to trigger a scan sequence (left+right channels) when
      PRS pulse occurs.

   3. The DMA is using a ping-pong transfer type to receive sampled data from the
      ADC0 into a buffer (right and left channel interleaved). When the specified
      number of samples has been received, the DMA will trigger an interrupt and
      switch sampling into an alternate buffer. The DMA interrupt handler only
      refreshes the use of the current buffer, and triggers a lower priority
      handler which processes the received audio stream.

   4. The DAC0 has been configured to trigger request for data from DMA when same
      PRS pulse as used for ADC0 occurs. This ensures synchronization between
      sampled data on input and converted signal and output. The data transferred
      to DAC0 will be taken from already received and processed data, thus a
      slight delay occurs, proportional with the buffer size.

   5. The DMA channel used by DAC0 is also using a ping-pong transfer type.

   Potentiometer (volume) handling:
   --------------------------------

   - The volume level (potentiometer) is sampled much less frequently by a single
     conversion done by ADC0. In order to not affect audio sampling start point,
     the tailgating mechanism is used.

   - The triggering of the volume level sampling (potentiometer) is issued by
     the service call interrupt handler which in turn is synchronized with the
     audio-in interrupt handler, providing a regular sampling trigger.
     (Actual ADC sampling is activated by the main handler since volumne control
     has low priority.)

   - When potentiometer sampling completed, LEDs indicating the current level
     are updated from the main routine.

   Task priority issues:
   ---------------------

   The most time critical task in this application is to keep the DMA ping-pong
   sequence going. At all times, the next descriptor must be refreshed prior
   to being used, otherwise the ping-pong DMA sequence will halt. This example
   application only have three tasks to handle, listed in order of priority:

   1. Keep DMA ping-pong sequence refreshed for both audio in and out (ADC/DAC)
   2. Process audio-in data for use by audio-out
   3. Update volume level/LEDs indicating volume level

