EnergyMicro/EFM32_Gxxx_DK/examples/preamp/preamp.c
   Task 1 is handled by interrupt handlers. Task 3 is done from the main function.
   Task 2 has higher priority than updating volume level, but is the actual
   task requiring some amount of processing. If a buffer of audio-in samples is
   not processed in time before being sent to audio-out, audio artifacts will occur.
   This may for instance occur if core frequency is set too low, not being able
   to complete processing of buffers in time.

   Since there is no OS available in this example, we implement a prioroity scheme
   by letting the ping-pong refresh be done in a high priority interrupt handler,
   and a SW triggered lower priority interrupt (PendSV) handler process the audio
   data.

   Energy mode usage:
   ------------------

   Due to the relatively high sampling rate, we need to keep the ADC warmed,
   and only EM1 may be used when idle.
*/

/*******************************************************************************
 *******************************   DEFINES   ***********************************
 ******************************************************************************/

/* Defines according to DVK design */
/** Pull-up resistor in ohm. */
#define POTENTIOMETER_PULLUP_OHM      10000
/** Potentiometer, max value. */
#define POTENTIOMETER_MAX_OHM         100000
/**
 * Voltage applied over pullup and potentiometer. (Notice that this voltage is
 * actually adjustable on the DVK, we assume default value.) If changed, the only
 * consequence is slightly different volume levels measured.
 */
#define POTENTIOMETER_VDD_mV          3300

/** Rpot adjustment done, allowing for 100 volume steps if Rpot max is 100kOhm */
#define PREAMP_ADJUST_DIVISOR         1000

/**
 * Number of samples for each channel processed at a time. By increasing
 * this number, less average interrupt handler overhead is added per sample, but
 * more memory is required, and increased delay added. If setting too low,
 * interrupt overhead will become too large, causing loss of data.
 */
#define PREAMP_AUDIO_BUFFER_SIZE      64    /* 64/44100 = appr 1.5 msec delay */

/** (Approximate) sample rate used for processing audio data. */
#define PREAMP_AUDIO_SAMPLE_RATE      44100

/** Number of times to sample volume (potentiometer) per second. */
#define PREAMP_VOLUME_SAMPLE_RATE     20

/** DMA channel used for audio in scan sequence (both right and left channel) */
#define PREAMP_DMA_AUDIO_IN           0

/** DMA channel used for audio out channels */
#define PREAMP_DMA_AUDIO_OUT          1

/** PRS channel used by TIMER to trigger ADC/DAC activity. */
#define PREAMP_PRS_CHANNEL            0

/*******************************************************************************
 ***************************   LOCAL VARIABLES   *******************************
 ******************************************************************************/

/** Variable indicate if primary or alternate audio buffer shall be processed */
static volatile bool preampProcessPrimary;

/** Flag used to trigger volume check */
static volatile bool preampCheckVolume;

/** Flag used to indicate that audio-out level has been clipped to limit volume */
static volatile bool preampAudioOutClipped;

/** Adjustment factor used for adjusting volume, this is Rpot/PREAMP_ADJUST_DIVISOR  */
static volatile uint32_t preampAdjustFactor;

/** Primary audio in buffer, holding both left and right channel (interleaved) */
static uint16_t preampAudioInBuffer1[PREAMP_AUDIO_BUFFER_SIZE * 2];
/** Alternate audio in buffer, holding both left and right channel (interleaved) */
static uint16_t preampAudioInBuffer2[PREAMP_AUDIO_BUFFER_SIZE * 2];

/** Primary audio out buffer, combined right/left channel in one uint32_t. */
static uint32_t preampAudioOutBuffer1[PREAMP_AUDIO_BUFFER_SIZE];
/** Alternate audio out buffer, combined right/left channel in one uint32_t. */
static uint32_t preampAudioOutBuffer2[PREAMP_AUDIO_BUFFER_SIZE];

/** Callback config for audio-in DMA handling, must remain 'live' */
static DMA_CB_TypeDef cbInData;
/** Callback config for audio-out DMA handling, must remain 'live' */
static DMA_CB_TypeDef cbOutData;

/** EFM32 rev B ADC errata; when using VDD as reference, need to multiply by 2 */
static int preampErrataShift;

/* Counters used to monitor IRQ handling, they should all be equal. If */
/* preampMonProcessCount falls behind, it is an indication that the */
/* system is unable to process incoming data with sufficient speed, and */
/* audio out artifacts will occur. */

/** Count number of interrupts on input buffer filled. */
static uint32_t preampMonInCount;
/** Count number of interrupts on output buffer sent. */
static uint32_t preampMonOutCount;
/** Count number of times buffer has been processed. */
static uint32_t preampMonProcessCount;


/*******************************************************************************
 ************************   INTERRUPT FUNCTIONS   ******************************
 ******************************************************************************/

/***************************************************************************//**
 * @brief
 *   Callback invoked from DMA interrupt handler when DMA transfer has filled
 *   an audio in buffer. (I.e. received from ADC.)
 *******************************************************************************/
static void preampDMAInCb(unsigned int channel, bool primary, void *user)
{
  (void)user; /* Unused parameter */

  /* Refresh DMA for using this buffer. DMA ping-pong will */
  /* halt if buffer not refreshed in time. */
  DMA_RefreshPingPong(channel,
                      primary,
                      false,
                      NULL,
                      NULL,
                      (PREAMP_AUDIO_BUFFER_SIZE * 2) - 1,
                      false);

  preampMonInCount++;

  /* Indicate buffer to be processed next */
  preampProcessPrimary = primary;

