EnergyMicro/EFM32_Gxxx_DK/examples/preamp/preamp.c
  /* Trigger lower priority interrupt which will process data */
  SCB->ICSR = SCB_ICSR_PENDSVSET_Msk;
}


/***************************************************************************//**
 * @brief
 *   Callback invoked from DMA interrupt handler when DMA transfer has used
 *   an audio out buffer. (I.e. transferred to DAC.)
 *******************************************************************************/
static void preampDMAOutCb(unsigned int channel, bool primary, void *user)
{
  (void)user; /* Unused parameter */

  /* Refresh DMA for using this buffer. DMA ping-pong will */
  /* halt if buffer not refreshed in time. */
  DMA_RefreshPingPong(channel,
                      primary,
                      false,
                      NULL,
                      NULL,
                      PREAMP_AUDIO_BUFFER_SIZE - 1,
                      false);

  preampMonOutCount++;
}

/***************************************************************************//**
 * @brief
 *   SW triggered interrupt used to process sampled data.
 *******************************************************************************/
void PendSV_Handler(void)
{
  /* Define max DAC output value, clipping is done if audio-out signal is outside */
  /* defined range. This is partly to limit max output volume, and partly to */
  /* add as low DC offset to DAC output as possible. A smaller DC offset reduces */
  /* the startup crack sound, although that could be avoided by more advanced */
  /* init features. */
  #define OUTPUT_RANGE       0xA0

  /**
   * Need to figure out average DC component in input signal (appr 1.65V
   * according to DVK design), since DC offset needs to be removed before adjusting
   * volume. If adjusting directly on input signal including DC offset, one would
   * also scale (the significant) DC offset, causing sharp transissions (and audio
   * out cracking noise) when adjusting volume. We only sample DC once during startup,
   * one could make more advanced monitoring features.
   */
  #define SAMPLE_DC_OFFSET_COUNT 2048
  static uint32_t dcOffsetSampleCount;
  static uint32_t dcAccRight;
  static uint32_t dcAccLeft;
  static uint32_t dcRight;
  static uint32_t dcLeft;

  static uint32_t volumeSampleCount;

  uint16_t *inBuf;
  uint32_t *outBuf;
  int32_t right;
  int32_t left;
  int i;

  preampMonProcessCount++;

  if (preampProcessPrimary)
  {
    inBuf = preampAudioInBuffer1;
    outBuf = preampAudioOutBuffer1;
  }
  else
  {
    inBuf = preampAudioInBuffer2;
    outBuf = preampAudioOutBuffer2;
  }

  /* Set start sample index */
  i = 0;

  /* Are we measuring DC offset average? Only done initially. */
  if (dcOffsetSampleCount < SAMPLE_DC_OFFSET_COUNT)
  {
    while (i < PREAMP_AUDIO_BUFFER_SIZE)
    {
      i++;

      /* Right channel */
      right = (int32_t)(*(inBuf++) << preampErrataShift);

      /* Left channel */
      left = (int32_t)(*(inBuf++) << preampErrataShift);

      /* Avoid using input signal until first DC measurement done */
      outBuf++;

      /* Measure DC component of audio-in channels? */
      dcAccRight += right;
      dcAccLeft += left;

      /* Finished measuring DC offset* */
      if (++dcOffsetSampleCount == SAMPLE_DC_OFFSET_COUNT)
      {
        dcRight = dcAccRight / SAMPLE_DC_OFFSET_COUNT;
        dcLeft  = dcAccLeft / SAMPLE_DC_OFFSET_COUNT;
        break;
      }
    }
  }

  /* Process input data */
  while (i < PREAMP_AUDIO_BUFFER_SIZE)
  {
    i++;

    /* Right channel */
    right = (int32_t)(*(inBuf++) << preampErrataShift);

    /* Left channel */
    left = (int32_t)(*(inBuf++) << preampErrataShift);

    /* Remove DC component of input signal */
    right -= dcRight;
    left -= dcLeft;

    /* Volume adjustment, using integer arithmetic */
    right = (right * (int32_t)preampAdjustFactor) /
            (POTENTIOMETER_MAX_OHM / PREAMP_ADJUST_DIVISOR);
    left = (left * (int32_t)preampAdjustFactor) /
           (POTENTIOMETER_MAX_OHM / PREAMP_ADJUST_DIVISOR);

    /* Add midpoint DC offset of allowed output range */
    right += OUTPUT_RANGE / 2;
    if (right < 0)
    {
      right = 0;
      preampAudioOutClipped = true;
    }
    else if (right > OUTPUT_RANGE)
    {
      right = OUTPUT_RANGE;
      preampAudioOutClipped = true;
    }

    left += OUTPUT_RANGE / 2;
    if (left < 0)
    {
      left = 0;
      preampAudioOutClipped = true;
    }
    else if (left > OUTPUT_RANGE)
    {
      left = OUTPUT_RANGE;
      preampAudioOutClipped = true;
    }

    /* Encode for use with DAC COMBDATA accessed by DMA */
    *(outBuf++) = ((uint32_t)left << 16) | (uint32_t)right;
  }

  /* Trigger sampling of potentiometer used for volume control? */
  volumeSampleCount += PREAMP_AUDIO_BUFFER_SIZE;
  if (volumeSampleCount >=  (PREAMP_AUDIO_SAMPLE_RATE / PREAMP_VOLUME_SAMPLE_RATE))
  {
    volumeSampleCount = 0;
    preampCheckVolume = true;
  }
}


/*******************************************************************************
 ***************************   LOCAL FUNCTIONS   *******************************
 ******************************************************************************/

/***************************************************************************//**
 * @brief
 *   Configure ADC usage for this application.
 *******************************************************************************/
static void preampADCConfig(void)
{
  DMA_CfgDescr_TypeDef descrCfg;
  DMA_CfgChannel_TypeDef chnlCfg;
  ADC_Init_TypeDef init = ADC_INIT_DEFAULT;
  ADC_InitSingle_TypeDef singleInit = ADC_INITSINGLE_DEFAULT;
  ADC_InitScan_TypeDef scanInit = ADC_INITSCAN_DEFAULT;

  /* Configure DMA usage by ADC */

  cbInData.cbFunc = preampDMAInCb;
  cbInData.userPtr = NULL;

  chnlCfg.highPri = true;
  chnlCfg.enableInt = true;
  chnlCfg.select = DMAREQ_ADC0_SCAN;
  chnlCfg.cb = &cbInData;
  DMA_CfgChannel(PREAMP_DMA_AUDIO_IN, &chnlCfg);

